#include <my_AT.h>
#define EEPROM_ADDR 0x50
#include <EncoderLibrary.h>
EncoderLibrary encoder(6, 7, 15, 20);
#include <my_TCS34725.h> 



void setup() 
  {    
      _seting();                 //-------------------->> ฟังก์ชัน ตั้งค่าต่าง ๆ ใน tab seting
      encoder.setupEncoder();    //-------------------->> เรียกฟังก์ชัน setupEncoder
      encoder.resetEncoders();  //--------------------->> ฟังก์ชันรอก
     

      //arm_up_close();
      arm_down_open();
      
      sw();             //-------------------->> ฟังก์ชันรอกดปุ่ม 
           
  
///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่      
  
     fline(30,30,0.68,"a0",'f','l',80, "a1", 20);
     fline(30,30,0.68,"a7",'f','r',80, "a6", 20);
     fline(30,30,0.68,"a7",'f','r',80, "a6", 20);
     fline(30,30,0.68,"a0",'f','l',80, "a1", 20);
     fline(30,30,0.68,"a0",'f','l',80, "a1", 20);









  

  //
  
  
  //30//45
  
  //fline(20,20,0.28,0,'f','l',80, "a2", 0);
  //fline(80,80,0.28,28,'c','s',80, "a1", 2);
  
///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่ 

  }  ///-->> บรรทัดห้ามลบ


///-------------------------->> คงไว้ห้ามลบ
void loop() {
   

  }
///-------------------------->> คงไว้ห้ามลบ
