
#include <my_RPOPT_mini.h>

void setup() 
  {
      setup_robot();
      to_set_motor_LR(90, 90);  //------->> ตั้งค่ามอเตอร์ถ้าหุ่นยนต์วิ่งไม่ตรง
    
      sw();    //------>> คำสั่งรอกดปุ่ม start


    //--------------------------------------------->>  เอาคำสั่งต่าง ๆ มา RUN ตรงนี้
    
    can_1();
    can_2();



    //--------------------------------------------->>  เอาคำสั่งต่าง ๆ มา RUN ตรงนี้
    //--------------------------------------------->>
  }
    
    
void loop() {}
