#include <my_MINI_RP.h>
#define EEPROM_ADDR 0x50
#include <EncoderLibrary.h>
EncoderLibrary encoder(6, 7, 15, 20);


void setup() 
  {    
      _seting();                 //-------------------->> ฟังก์ชัน ตั้งค่าต่าง ๆ ใน tab seting
      encoder.setupEncoder();    //-------------------->> เรียกฟังก์ชัน setupEncoder
      encoder.resetEncoders();  //--------------------->> ฟังก์ชันรอก
     

      arm_down_open();
      sw();             //-------------------->> ฟังก์ชันรอกดปุ่ม       
  
///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่      

     
     fline(50, 50, 0.25, 0, 'c', 'l', 60, "a1", 40); sw();
     fline(50, 50, 0.25, 0, 'c', 'r', 60, "a6", 40); sw();
     fline(50, 50, 0.25, 0, 'c', 's', 60, "a1", 40); sw();


///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่ 

  }  ///-->> บรรทัดห้ามลบ


///-------------------------->> คงไว้ห้ามลบ
void loop() { }
///-------------------------->> คงไว้ห้ามลบ
