void exsampleS()
  {
    fline(50,50,0.25,0,'c','l',50, "a2", 50);   //------->> เดินหน้าเจอแยกหมุนซ้าย
    fline(50,50,0.25,0,'c','r',50, "a5", 50);   //------->> เดินหน้าเจอแยกหมุนขวา

    fline(50,50,0.25,0,'c','p',50, "a5", 0);   //------->> เดินหน้าเจอแยกข้ามแยก

    fline(20,20,0.25,0,'f','s',50, "a2", 30);   //------->> เดินหน้าเจอแยกหยุดที่เซนเซอร์หน้า
    fline(20,20,0.25,0,'c','s',50, "a2", 30);   //------->> เดินหน้าเจอแยกหยุดที่ล้อ

    //--------------------------------------------------------------------------------||

    bline(50,50,0.25,0,'c','l',50, "a2", 50);   //------->> ถอยหลังเจอแยกหมุนซ้าย
    bline(50,50,0.25,0,'c','r',50, "a5", 50);   //------->> ถอยหลังเจอแยกหมุนขวา

    bline(50,50,0.25,0,'c','p',50, "a5", 0);   //------->> ถอยหลังเจอแยกข้ามแยก

    bline(20,20,0.25,0,'f','s',50, "a2", 30);   //------->> ถอยหลังเจอแยกหยุดที่เซนเซอร์หน้า
    bline(20,20,0.25,0,'c','s',50, "a2", 30);   //------->> ถอยหลังเจอแยกหยุดที่ล้อ

    //--------------------------------------------------------------------------------||

    arm_ready();  // ----------->> เอามือจับลงเตรียมพร้อม

    arm_close_up();   // ----------->> มือจับ หยิบกระป๋อง ยกขึ้น
    
    arm_down_open_up();

    place_right();  // ----------->> หมุนวางกระป๋องทางด้านขวา
    place_letf();  // ----------->> หมุนวางกระป๋องทางด้านซ้าย
  }
