#include <my_rp_pro.h>
#define EEPROM_ADDR 0x50
#include <EncoderLibrary.h>
EncoderLibrary encoder(0, 15, 24, 20);
//------------------------->>

void setup() 
  {    
      _seting();         //-------------------->>   ฟังก์ชัน ตั้งค่าต่าง ๆ ใน tab seting
      encoder.setupEncoder(); // เรียกฟังก์ชัน setupEncoder
      encoder.resetEncoders(); 

      
      sw();             //-------------------->> ฟังก์ชันรอกดปุ่ม       
      
///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่      
     while(mcp_f(3) > md_mcp_f(3))
        {
          Motor(-30, 30);
        }
    Motor(30, -30); delay(30);
    Motor(0, 0); 


///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่ 

  }


///-------------------------->> คงไว้ห้ามลบ
void loop() { }
///-------------------------->> คงไว้ห้ามลบ
