#include <my_rp_pro.h>
#define EEPROM_ADDR 0x50
#include <EncoderLibrary.h>
EncoderLibrary encoder(0, 15, 24, 20);
//------------------------->>

void setup() 
  {    
      _seting();         //-------------------->>   ฟังก์ชัน ตั้งค่าต่าง ๆ ใน tab seting
      encoder.setupEncoder(); // เรียกฟังก์ชัน setupEncoder
      encoder.resetEncoders(); 

      arm_down_open();
      sw();             //-------------------->> ฟังก์ชันรอกดปุ่ม       
      
///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่      

     
     bline(60, 60, 0.25, 30, 'c', 'l', 50, "a2", 60); 
     fline(30, 30, 0.25, 0, 'f', 's', 60, "a1", 40); sw();
     
     bline(60, 60, 0.25, 0, 'c', 'l', 50, "a2", 60); 
     fline(30, 30, 0.25, 0, 'f', 's', 60, "a1", 40); sw();
     


///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่ 

  }


///-------------------------->> คงไว้ห้ามลบ
void loop() { }
///-------------------------->> คงไว้ห้ามลบ
