#include <my_rp2040.h>

unsigned long lasts_time_servo=millis();
int servo_down = 37;
int servo_up = 130;
void setup() 
  {    
      Serial.begin(9600);
      sensor_set(); 
       
      pos_motor_cal(15, 15, 10);
      to_set_motor_LR(100, 100);          //ตั้งค่ามอเตอร์ให้หุ่นยนต์วิ่งตรง
      
      to_slow_motor(30, 30);           // ตั้งค่า ความเร็วมอเตอร์เวลาเข้าแยก
      to_turn_center_l(-100, 100 );   // ตั้งค่ามอเตอร์หมุนซ้ายขวา ตอนเลี้ยวซ้ายแบบ center
      to_turn_center_r(100, -100 );   // ตั้งค่ามอเตอร์หมุนซ้ายขวา ตอนเลี้ยวขาวแบบ center
      to_turn_front_l(-15, 100);     // ตั้งค่ามอเตอร์หมุนซ้ายขวา ตอนเลี้ยวซ้ายแบบ เซนเซอร์หน้า  เดินหน้า
      to_turn_front_r(100, -15);     // ตั้งค่ามอเตอร์หมุนซ้ายขวา ตอนเลี้ยวขวาแบบ เซนเซอร์หน้า  เดินหน้า
      to_speed_turn_fl(100, 30, 30);  // ค่าพุ่งตัวออกหลังจากการเลี้ยว มีผลต่อตัวแปรสุดท้ายของคำสั่งเลี้ยว ถ้าเป็น 0
      to_speed_turn_fr(30, 100, 30);  // ค่าพุ่งตัวออกหลังจากการเลี้ยว มีผลต่อตัวแปรสุดท้ายของคำสั่งเลี้ยว ถ้าเป็น 0
      
      to_brake_fc(29, 60);            // ตั้งค่าในการหยุดมอเตอร์ก่อนหมุนซ้ายขวา to_brake_fc(...f..., ....c...); 
      to_delay_f(5);                 // ระยะทางในการข้ามเส้นเวลาหมุนตัวแบบ f
    
      kp_sl(0.15, 0.15);  // kp และ ki ในฟังก์ เดินตามเส้นแบบช้า
      kd_fw(0.8);
      kd_bw(2);     
  
     
      //servo_down_open() ;    

      sw();    // คำสั่งรอกดปุ่ม sw-GP9

 ///------------------------------->>>>>>  เขียน code ที่นี่

      //fline(40,40,0.3,0,'c','l',80, "a2", 30);
      Motor(50,50);


///-------------------------------->>>>>>

      
  }

void loop() 
  {  
   // rgb(0, 1, 0); delay(300);
   // rgb(1, 0, 0); delay(300);
   // rgb(0, 0, 1); delay(300);

  }
