#include <my_rp_pro.h>
#include <my_TCS34725.h> 

void setup() 
  {    
      _seting();         //-------------------->> ฟังก์ชัน ตั้งค่าต่าง ๆ ใน tab seting
     
      //arm_up_close();
      //arm_down_open();
      //arm_down_close();

      arm_down_open();
      
      sw();             //-------------------->> ฟังก์ชันรอกดปุ่ม       
      //test_bord();
///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่      

     fline(70,70,0.28,30,'f','l',80, "a1", 40);
     fline(70,70,0.28,0,'f','s',80, "a1", 40);


  

///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่ 

  }  ///-->> บรรทัดห้ามลบ


///-------------------------->> คงไว้ห้ามลบ
void loop() {
     Serial.println(encoder.Poss_L());
     Serial.println(my_tcs('r'));
  }
///-------------------------->> คงไว้ห้ามลบ
