/*
fline(40,40,0.3,0,'c','r',70, "a5", 13);  ขวา
fline(40,40,0.3,0,'c','l',70, "a2", 13);  ซ้าย
fline(40,40,0.3,0,'c','p',70, "a2", 0);   ข้าม
fline(40,40,0.3,0,'c','s',70, "a2", 15);  หบุด

fline_2sensor(50,50,0.8,0,0,'p',0); เร็ว

mission( 30, 30, 0.3, 100,"big");  คีบ

mission_L();
mission_R();
mission_L_M();
mission_R_M();



///////////////////////// เดินตามพื้นขาวไปเลือยเลือยจนกว่าจะเจอดำ

do{Motor(30,30);}while(mcp_f(7)>md_mcp_f(7));
    Motor(-10,-10);
    delay(10);
    Motor(0,0);
    delay(10);
///////////////////////// เดินตามพื้นขาวไปเลือยเลือยจนกว่าจะเจอดำ

//////////////////////// sensor กลาง

analogRead(26)///////////// md_adc(26)
                    
analogRead(27) <= md_adc(27)-50 

/////////////////////// do while เช็นเซอร์กลาง

do{Motor(30,30);}while(analogRead(26)>md_adc(26));
    Motor(-30,-30);
    delay(10);
    Motor(0,0);
    delay(10);
/////////////////////// do while เช็นเซอร์กลาง


//////////////////////// ว่างหยดน้ำ

fline(30,30,0.5,0,7,'p',10);
    do{Motor(-30,30);}while(mcp_f(4)>md_mcp_f(4));
    Motor(30,-30);
    delay(10);
    fline_2sensor(30,30,0.3,400,0,'s',30);
    do{Motor(20,-20);}while(mcp_f(0)>md_mcp_f(0));
    Motor(-20,20);
    delay(10);
    Motor(0,0);
    delay(10);
    servo_down_open();

//////////////////////// ว่างหยดน้ำ

//////////////////////// คีบหยดน้ำขวา

fline_2sensor(40,40,0.5,0,7,'s',10);
    do{Motor(40,20);}while(mcp_f(0)>md_mcp_f(0));
    delay(10);
    do{Motor(40,20);}while(mcp_f(0)<md_mcp_f(0));
    delay(50);
    fline(0,0,0.3,10,'c','l',30, "a3", 15);

//////////////////////// คีบหยดน้ำขวา


//////////////////////// คีบหยดน้ำช้าย
fline_2sensor(40,40,0.5,0,0,'s',10);
    do{Motor(20,40);}while(mcp_f(7)>md_mcp_f(7));
    delay(10);
    do{Motor(20,40);}while(mcp_f(7)<md_mcp_f(7));
    delay(50);
    fline(0,0,0.3,10,'c','r',30, "a4", 15);
//////////////////////// คีบหยดน้ำช้าย


//////////////////////// ถ้อยหัวหยดน้ำ
bline(0,0,0.3,10,'c','r',40, "b4", 13);
    bline(50,50,0.8,1200,'c','s',70, "a5", 13);
//////////////////////// ถ้อยหัวหยดน้ำ

//////////////////////// คีบข้างขวาหยดน้ำ
do{Motor(30,30);}while(mcp_f(7)>md_mcp_f(7));
      Motor(-10,-10);
      delay(10);
      servo_down_open();
      do{Motor(30,30);}while(analogRead(27)>md_adc(27));
      Motor(-30,-30);
      delay(10);
      Motor(0,0);
      delay(10);
      fline(0,0,0.3,10,'n','l',40, "a3", 13);
    
      mission( 30, 30, 0.1, 200,"big");
//////////////////////// ถ้อยข้างขวาหยดน้ำ


//////////////////////// วิ่งข้ามทางโคง
fline(40,40,0.3,300,'n','s',70, "a5", 3);
    servo_up_open();
    delay(200);
    do{Motor(30,30);}while(mcp_f(0)>md_mcp_f(0));
    Motor(-10,-10);
    delay(10);
//////////////////////// วิ่งข้ามทางโคง
*/
