#include <my_rp2040.h>

unsigned long lasts_time_servo=millis();
int servo_down = 73;      //-------------------->> ตั้งค่า มื่อจับลงขนานกับพื้น
int servo_up = 140;       //-------------------->> ตั้งค่า มื่อจับยกขึ้นตั้งฉากกับพื้น

void setup() 
  {    
      _seting();         //-------------------->>   ฟังก์ชัน ตั้งค่าต่าง ๆ ใน tab seting
      
     
      //servo_down_open() ;    
      //servo_up_close() ;

      
      sw();             //-------------------->> ฟังก์ชันรอกดปุ่ม

      
    //////////////////------------------------>>>>>  Run funtion
    for(int i=0; i<5; i++)
      {
        fline(80,80,0.5,0,'c','s',80, "a4", 20);
        bline(70,70,0.2,0,'c','s',80, "a2", 20);
      }
  
    //////////////////------------------------>>>>>  

  }

void loop() {}
