
#include <my_rp2350_Pro.h>
void setup() 
  {
    setup_rp2350_pro();
     // ใช้ I2C1
  Serial.begin(115200);

    
    //arm_up_close();  //--->> ยกแขนขึ้นหุบฝ่ามือเข้า
    arm_down_open();
    sw();  //--->> คำสั่งรอกดปุ่ม


    ////------------------------------------------------------------------------------>> รันคำสั่งต่าง ๆ ที่นี่

    
    fline(40, 40, 0.75, 80, 'f', 'l', 80, "a2", 1); 
    fline(80, 80, 0.65, 40, 'f', 'r', 80, "a5", 1);
    fline(30, 30, 0.85, "a7", 'f', 'r', 80, "a5", 1); 
    fline(30, 30, 0.85, "a7", 'f', 'r', 80, "a5", 1); 
    
    fline(30, 30, 0.85, "a07", 'f', 'l', 80, "a3", 1); 
    arm_up_open();
    fline(30, 30, 0.35, 0, 'c', 'l', 50, "a2", 10); 
    arm_ready() ;
    fline(10, 10, 0.85, 0, 'f', 's', 50, "a5", 10); 
    arm_down_close();
    bline(0, 0, 0.85, 0, 'c', 'l', 50, "a2", 20); 
    fline(30, 30, 0.85, "a7", 'c', 'r', 50, "a6", 10);
    fline(30, 30, 0.85, 80, 'f', 'l', 80, "a2", 1); 
    fline(30, 30, 0.85, "a0", 'f', 'l', 80, "a2", 1); 
    fline(30, 30, 0.85, "a0", 'f', 'l', 80, "a2", 1); 
    fline(80, 80, 0.65, 30, 'f', 'r', 80, "a5", 1);
    fline(40, 40, 0.75, "a07", 'f', 's', 80, "a2", 1); 



    sw();
    fline(30, 30, 0.85, "a7", 'f', 'r', 80, "a5", 1); 
    fline(30, 30, 0.75, "a0", 'f', 'r', 80, "a4", 1);
    fline(30, 30, 0.75, "a7", 'f', 'p', 80, "a5", 0);
    fline(50, 50, 0.85, 20, 'f', 'r', 80, "a5", 1); 
    fline(20, 20, 0.35, 15, 'n', 's', 50, "a6", 10); 
    
    place_left_in(30, 90, 20) ;
   fw_gyro(50, 50, 0.85, 30, 10);
   
   //fline(40, 40, 0.85, 20, 'n', 's', 90, "a2", 1);
   //fline(30, 30, 0.75, "a7", 'f', 'r', 90, "a2", 1);
   //fline(30, 30, 0.85, "a7", 'f', 's', 90, "a2", 1);


    ////------------------------------------------------------------------------------>> จบการรันคำสั่งต่าง ๆ 

  }

void loop() 
  {
    //Serial.print( analogRead(46) );   Serial.print( "   " );   Serial.println( analogRead(47) ); 
    Serial.println(my.gyro('z'));   
  delay(10);
  

  }
