#include <my_rpProV2.h>
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
int servo_down = 50;        //-------------------->> ตั้งค่า มื่อจับลงขนานกับพื้น
int servoL_open = 120;      //-------------------->> ตั้งค่า กางฝ่ามือด้านซ้าย
int servoR_open = 125;      //-------------------->> ตั้งค่า กางฝ่ามือด้านขวา
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ

void setup() 
  {
    setup_rp2350_pro();
    set_motor();

   //------------------------->>  ส่วนของคำสั่งในการเตรียมแขนกล 
    //arm_up_close();  //--->> ยกแขนขึ้นหุบฝ่ามือเข้า  เอาไว้ใช้งานตอนก่อนเริ่มการแข่งขัน
    arm_down_open();   //--->> แขนลงกางฝ่ามือออก
    arm_l_r(120, 120, 50);
   //------------------------->>  ส่วนของคำสั่งในการเตรียมแขนกล 

    sw();  //--->> คำสั่งรอกดปุ่ม
   
    ////------------------------------------------------------------------------------>> รันคำสั่งต่าง ๆ ที่นี่

    
    /*
     fline(40, 40, 0.1, "a0", 'f', 's', 50, "a6", 10);
     sw();
     fline(40, 40, 0.2, "a0", 'f', 's', 50, "a6", 10);
     sw();
     fline(40, 40, 0.5, "a0", 'f', 's', 50, "a6", 10);
     sw();

*/


    ////------------------------------------------------------------------------------>> จบการรันคำสั่งต่าง ๆ 

  }

void loop() 
  {

    arm_up_down(100, 50) ;
    delay(1000);
    arm_up_down(40, 50);
    delay(1000);

    /*
    arm_lr(5, 5, 50); // ตัวอย่าง: หมุนเซอร์โว 34 ไปที่ 140 องศา, เซอร์โว 35 ไปที่ 100 องศา, หน่วง 50ms ต่อขั้น
    delay(2000); // รอ 2 วินาที
    arm_lr(120, 120, 50); // กลับไปตำแหน่งเริ่มต้น
    delay(2000);
    arm_lr(5, 5, 10); // ตัวอย่าง: หมุนเซอร์โว 34 ไปที่ 140 องศา, เซอร์โว 35 ไปที่ 100 องศา, หน่วง 50ms ต่อขั้น
    delay(2000); // รอ 2 วินาที
    arm_lr(40, 120, 50); // กลับไปตำแหน่งเริ่มต้น
    delay(2000);
    */
    //Serial.print(my.gyro('z')); Serial.print( "   " ); 
    //Serial.print( analogRead(46) );   Serial.print( "   " );   Serial.println( analogRead(47) ); 
      
    //delay(10);
     //Serial.print(sensorMin_A[0] );

  }
