#include <my_rp_pro.h>

void setup() 
  {    
      _seting();         //-------------------->> ฟังก์ชัน ตั้งค่าต่าง ๆ ใน tab seting
     

      arm_down_open();
      //arm_down_close();
      
      sw();             //-------------------->> ฟังก์ชันรอกดปุ่ม       
  
///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่      
 
 

  

///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่ 

  }  ///-->> บรรทัดห้ามลบ


///-------------------------->> คงไว้ห้ามลบ
void loop() {

     Serial.println(encoder.Poss_R());
     delay(10);
  }
///-------------------------->> คงไว้ห้ามลบ
