#include <my_rp_pro.h>
#define EEPROM_ADDR 0x50
#include <EncoderLibrary.h>
EncoderLibrary encoder(0, 15, 24, 20);
//------------------------->>

void setup() 
  {    
      _seting();         //-------------------->>   ฟังก์ชัน ตั้งค่าต่าง ๆ ใน tab seting
      encoder.setupEncoder(); // เรียกฟังก์ชัน setupEncoder
      encoder.resetEncoders(); 

      arm_down_open();
      sw();             //-------------------->> ฟังก์ชันรอกดปุ่ม       
      
///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่      

     
     bline(50, 50, 0.35, 0, 'c', 'l', 60, "a1", 40); sw();
     bline(50, 50, 0.35, 0, 'c', 'r', 60, "a6", 40); sw();
     bline(70, 70, 0.35, 0, 'c', 's', 60, "a1", 40); sw();


///------------------------------------------------------------------>>>>  เขียนโค๊ดที่นี่ 

  }


///-------------------------->> คงไว้ห้ามลบ
void loop() { }
///-------------------------->> คงไว้ห้ามลบ
