#include <my_rpProV2.h>

//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
int servo_down = 40;        //-------------------->> ตั้งค่า มื่อจับลงขนานกับพื้น
int servoL_open = 120;      //-------------------->> ตั้งค่า กางฝ่ามือด้านซ้าย
int servoR_open = 120;      //-------------------->> ตั้งค่า กางฝ่ามือด้านขวา
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ

void setup() 
  {
    setup_rp2350_pro();
    set_motor();
    //----------------------------------------------------------------------------->> ตั้งค่ามือจับ
    s34_trim(0);
    s35_trim(0);
    s36_trim(0);
    //----------------------------------------------------------------------------->> ตั้งค่ามือจับ

   //------------------------->>  ส่วนของคำสั่งในการเตรียมแขนกล 
    arm_left_right(servoL_open, servoR_open, 50);
    arm_up_down(servo_down, 50) ;
   //------------------------->>  ส่วนของคำสั่งในการเตรียมแขนกล 

    sw();  //--->> คำสั่งรอกดปุ่ม
   
    ////------------------------------------------------------------------------------>> รันคำสั่งต่าง ๆ ที่นี่




    ////------------------------------------------------------------------------------>> จบการรันคำสั่งต่าง ๆ 

  }

void loop() 
  {
    arm_left_right(25, 25, 50);
    delay(1000);
    arm_up_down(120, 50) ;
    delay(1000);
    arm_up_down(35, 50);
    delay(1000);
    arm_left_right(70, 125, 50);
    delay(1000);
    arm_up_down(120, 20) ;
    delay(1000);
    arm_left_right(25, 25, 50);
    delay(1000);
    arm_up_down(35, 20);
    delay(1000);
    arm_left_right(125, 125, 50);
    delay(1000);

    //Serial.print(my.gyro('z')); Serial.print( "   " ); 
    //Serial.print( analogRead(46) );   Serial.print( "   " );   Serial.println( analogRead(47) ); 
      
    //delay(10);
     //Serial.print(sensorMin_A[0] );

  }
