#include <myrp_pico2.h>

//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
int servo_down = 45;        //-------------------->> ตั้งค่า มื่อจับลงขนานกับพื้น
int servoL_open = 110;      //-------------------->> ตั้งค่า กางฝ่ามือด้านซ้าย
int servoR_open = 120;      //-------------------->> ตั้งค่า กางฝ่ามือด้านขวา
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ


void setup() 
  {
    setup_robot() ;
    set_motor();
    encoder.setupEncoder();    //-------------------->> เรียกฟังก์ชัน setupEncoder
    encoder.resetEncoders();  //--------------------->> ฟังก์ชันรอก
    //----------------------------------------------------------------------------->> ตั้งค่ามือจับ
   // s34_trim(0);
   // s35_trim(20);
   // s36_trim(0);
  //----------------------------------------------------------------------------->> ตั้งค่ามือจับ
    arm_down_open();
   //------------------------->>  ส่วนของคำสั่งในการเตรียมแขนกล 
 
    sw();  //--->> คำสั่งรอกดปุ่ม
    //resetAngles();
   
    ////------------------------------------------------------------------------------>> รันคำสั่งต่าง ๆ ที่นี่

    fline(30, 30, 0.45, 0, 'c', 'r', 50, "a5", 20);     
    arm_down_close();
    
    fline(50, 50, 0.45, 0, 'c', 'l', 50, "a2", 20); 
    fline(30, 30, 0.85, "a0", 'f', 'p', 50, "a2", 0); 
    fline(30, 30, 0.85, "a7", 'f', 'r', 80, "a5", 5); 
    fline(60, 60, 0.65, 20, 'f', 'r', 80, "a5", 5); 
    fline(60, 60, 0.65, 55, 'f', 's', 80, "a2", 5);

    bline(50, 50, 0.85, 20, 'c', 'l', 50, "a2", 20);
    fline(30, 30, 0.85, 72, 'n', 's', 50, "a5", 5);
    fline(30, 30, 0.50, "a7", 'f', 'r', 80, "a5", 5); 
    fline(30, 30, 0.55, "a0", 'f', 'l', 80, "a2", 5); 
    fline(30, 30, 0.85, "a07", 'n', 's', 50, "a5", 5);   
    fline(0, 0, 0.85, 0, 'c', 'r', 50, "a5", 1); 
    fline(0, 0, 0.85, 0, 'c', 'r', 50, "a5", 20); 

    fline(30, 30, 0.55, "a0", 'f', 'l', 80, "a2", 5); 
    fline(30, 30, 0.50, "a7", 'f', 'r', 80, "a5", 5); 
    fline(30, 30, 0.55, "a0", 'f', 'l', 80, "a2", 5); 
    fline(30, 30, 0.85, "a07", 'f', 'r', 80, "a5", 5);
    fline(70, 70, 0.45, 25, 'f', 'l', 80, "a2", 5); 
    fline(70, 70, 0.45, 25, 'f', 'l', 80, "a2", 5);

    fline(30, 30, 0.95, "a7", 'f', 'p', 50, "a2", 0); 
    fline(30, 30, 0.95, "a7", 'f', 'r', 80, "a5", 5); 
    fline(70, 70, 0.85, 25, 'f', 's', 80, "a5", 20); 

   
   

    ////------------------------------------------------------------------------------>> จบการรันคำสั่งต่าง ๆ 
  
  }

void loop() 
  {
    
     //Serial.print(); Serial.println( "   " ); 
    //Motor(30, 30);servo(10, 40);servo(1, 40);servo(0, 40);delay(1000);
    //Motor(-30, -30);servo(10, 140);servo(1, 140);servo(0, 140);delay(1000);
    //Motor(30, 30); delay(1000);
    //Motor(-30, -30); delay(1000);
     // Serial.print(encoder.Poss_L());Serial.print("  "); Serial.println(encoder.Poss_R());
   Serial.print("my.gyro('z') :");Serial.print(my.gyro('z')); Serial.println( "   " ); 
    //Serial.print( analogRead(26) );   Serial.print( "  " );   Serial.print( analogRead(27) ); Serial.println( "     " );
    //Serial.print(  md_sensorC(0));   Serial.print( "  " );   Serial.println(  md_sensorC(1) ); 
      
    delay(10);
     //Serial.print(sensorMin_A[0] );

  }
