void _seting()
  {
      Serial.begin(9600);  
      Wire.begin();  
      dis.init();
      dis.configureDefault();
      dis.setTimeout(500);

      to_set_Freq(20000);      // กำหนดความถี่ให้กับมอเตอร์เกาหลี (20000)
                                // กำหนดความถี่ให้กับมอเตอร์ธรรมกา(1000)
      
      to_set_motor_LR(100, 100);          //ตั้งค่ามอเตอร์ให้หุ่นยนต์วิ่งตรง
      
      to_slow_motor(30, 30);           // ตั้งค่า ความเร็วมอเตอร์เวลาเข้าแยก
      to_turn_center_l(-100, 100 );   // ตั้งค่ามอเตอร์หมุนซ้ายขวา ตอนเลี้ยวซ้ายแบบ center
      to_turn_center_r(100, -100 );   // ตั้งค่ามอเตอร์หมุนซ้ายขวา ตอนเลี้ยวขาวแบบ center
      to_turn_front_l(-20, 100);     // ตั้งค่ามอเตอร์หมุนซ้ายขวา ตอนเลี้ยวซ้ายแบบ เซนเซอร์หน้า  เดินหน้า
      to_turn_front_r(100, -20);     // ตั้งค่ามอเตอร์หมุนซ้ายขวา ตอนเลี้ยวขวาแบบ เซนเซอร์หน้า  เดินหน้า
      to_speed_turn_fl(100, 20, 50);  // ค่าพุ่งตัวออกหลังจากการเลี้ยว มีผลต่อตัวแปรสุดท้ายของคำสั่งเลี้ยว ถ้าเป็น 0
      to_speed_turn_fr(20, 100, 50);  // ค่าพุ่งตัวออกหลังจากการเลี้ยว มีผลต่อตัวแปรสุดท้ายของคำสั่งเลี้ยว ถ้าเป็น 0
      
      to_brake_fc(20, 30);            // ตั้งค่าในการหยุดมอเตอร์ก่อนหมุนซ้ายขวา to_brake_fc(...f..., ....c...); 
      to_brake_bc(2, 10);
      to_delay_f(1);                 // ระยะทางในการข้ามเส้นเวลาหมุนตัวแบบ f
    
      kp_sl(0.15, 0.35);  // kp และ kd ในฟังก์ เดินตามเส้นแบบช้า
      kd_fw(0.2);
      kd_bw(0.3);

      pos_motor_cal(10, 10, 10);   // ตั้งค่า คาริเบลทเซนเซอร์
      sensor_set();
      //setup_tcs();
  }
